module.exports = [
  {
    id: 1,
    text: "Изучение основных принципов ООП в программировании является фундаментальным шагом для разработчиков. ООП помогает создавать модульный, понятный и гибкий код, что упрощает разработку",
    articleId: 1,
    userId: 1,
    profileId: 1,
  },
  {
    id: 2,
    text: "Объекты представляют собой экземпляры классов, которые являются шаблонами для создания объектов.",
    articleId: 1,
    userId: 1,
    profileId: 1,
  },
  {
    id: 3,
    text: "Объекты представляют собой экземпляры классов, которые являются шаблонами для создания объектов. Объекты представляют собой экземпляры классов, которые являются шаблонами для создания объектов.",
    articleId: 1,
    userId: 1,
    profileId: 1,
  },
];
